---
kind: enumMember
id: F:Autodesk.Revit.DB.LabelType.TotalLength
enum: Autodesk.Revit.DB.LabelType
source: html/018ae2fa-99f8-5788-40bb-d6ca5de2681c.htm
---
# Autodesk.Revit.DB.LabelType.TotalLength

The total length of the dimension.